experiment_data/ycsb/CockroachDB/run-rper100-hst3-srv9-thr5-this2.log
java -cp /home/ubuntu/CockroachDB-ycsb/postgresql-42.2.2.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/jdbc-binding/conf:/home/ubuntu/CockroachDB-ycsb/ycsb/conf:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/openjpa-jdbc-2.1.1.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/serp-1.13.1.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/commons-collections-3.2.1.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/commons-lang-2.4.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/core-0.12.0.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/commons-pool-1.5.4.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/geronimo-jta_1.1_spec-1.1.1.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/openjpa-lib-2.1.1.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/openjpa-kernel-2.1.1.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/jackson-core-asl-1.9.4.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/HdrHistogram-2.1.4.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/jdbc-binding-0.12.0.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/geronimo-jms_1.1_spec-1.1.1.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.JdbcDBClient -P /home/ubuntu/CockroachDB-ycsb/workloads/workload100 -P /home/ubuntu/CockroachDB-ycsb/cockroachdb.properties -threads 5 -p db.url=jdbc:postgresql://172.31.8.131:26257/test -p measurementtype=histogram -p histogram.buckets=25 -p operationcount=300000 -t
YCSB Client 0.12.0
Command line: -db com.yahoo.ycsb.db.JdbcDBClient -P /home/ubuntu/CockroachDB-ycsb/workloads/workload100 -P /home/ubuntu/CockroachDB-ycsb/cockroachdb.properties -threads 5 -p db.url=jdbc:postgresql://172.31.8.131:26257/test -p measurementtype=histogram -p histogram.buckets=25 -p operationcount=300000 -t
Loading workload...
Starting test.
Adding shard node URL: jdbc:postgresql://172.31.8.131:26257/test
Adding shard node URL: jdbc:postgresql://172.31.8.131:26257/test
Adding shard node URL: jdbc:postgresql://172.31.8.131:26257/test
[...]
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
[...]
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[OVERALL], RunTime(ms), 85843.0
[OVERALL], Throughput(ops/sec), 3494.752047342241
[TOTAL_GCS_PS_Scavenge], Count, 11.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 22.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.02562818168050977
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 11.0
[TOTAL_GC_TIME], Time(ms), 22.0
[TOTAL_GC_TIME_%], Time(%), 0.02562818168050977
[READ], Operations, 300000
[READ], AverageLatency(us), 1424.6551233333332
[READ], LatencyVariance(us), 1360733.933530085
[READ], MinLatency(us), 523
[READ], MaxLatency(us), 45355
[READ], 95thPercentileLatency(us), 2000
[READ], 99thPercentileLatency(us), 6000
[READ], Return=OK, 300000
[READ], 0, 129587
[READ], 1, 146670
[READ], 2, 12980
[READ], 3, 2726
[READ], 4, 2223
[READ], 5, 1542
[READ], 6, 1272
[READ], 7, 1591
[READ], 8, 622
[READ], 9, 250
[READ], 10, 103
[READ], 11, 63
[READ], 12, 40
[READ], 13, 39
[READ], 14, 26
[READ], 15, 24
[READ], 16, 26
[READ], 17, 31
[READ], 18, 32
[READ], 19, 32
[READ], 20, 15
[READ], 21, 24
[READ], 22, 18
[READ], 23, 18
[READ], 24, 7
[READ], >25, 39
[CLEANUP], Operations, 5
[CLEANUP], AverageLatency(us), 123.2
[CLEANUP], LatencyVariance(us), 8629.759999999998
[CLEANUP], MinLatency(us), 60
[CLEANUP], MaxLatency(us), 308
[CLEANUP], 95thPercentileLatency(us), 0
[CLEANUP], 99thPercentileLatency(us), 0
[CLEANUP], 0, 5
[CLEANUP], 1, 0
[CLEANUP], 2, 0
[CLEANUP], 3, 0
[CLEANUP], 4, 0
[CLEANUP], 5, 0
[CLEANUP], 6, 0
[CLEANUP], 7, 0
[CLEANUP], 8, 0
[CLEANUP], 9, 0
[CLEANUP], 10, 0
[CLEANUP], 11, 0
[CLEANUP], 12, 0
[CLEANUP], 13, 0
[CLEANUP], 14, 0
[CLEANUP], 15, 0
[CLEANUP], 16, 0
[CLEANUP], 17, 0
[CLEANUP], 18, 0
[CLEANUP], 19, 0
[CLEANUP], 20, 0
[CLEANUP], 21, 0
[CLEANUP], 22, 0
[CLEANUP], 23, 0
[CLEANUP], 24, 0
[CLEANUP], >25, 0