experiment_data/ycsb/CockroachDB/run-rper50-hst3-srv9-thr1-this2.log
java -cp /home/ubuntu/CockroachDB-ycsb/postgresql-42.2.2.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/jdbc-binding/conf:/home/ubuntu/CockroachDB-ycsb/ycsb/conf:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/openjpa-jdbc-2.1.1.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/serp-1.13.1.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/commons-collections-3.2.1.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/commons-lang-2.4.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/core-0.12.0.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/commons-pool-1.5.4.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/geronimo-jta_1.1_spec-1.1.1.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/openjpa-lib-2.1.1.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/openjpa-kernel-2.1.1.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/jackson-core-asl-1.9.4.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/HdrHistogram-2.1.4.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/jdbc-binding-0.12.0.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/geronimo-jms_1.1_spec-1.1.1.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.JdbcDBClient -P /home/ubuntu/CockroachDB-ycsb/workloads/workload50 -P /home/ubuntu/CockroachDB-ycsb/cockroachdb.properties -threads 1 -p db.url=jdbc:postgresql://172.31.8.131:26257/test -p measurementtype=histogram -p histogram.buckets=25 -p operationcount=300000 -t
YCSB Client 0.12.0
Command line: -db com.yahoo.ycsb.db.JdbcDBClient -P /home/ubuntu/CockroachDB-ycsb/workloads/workload50 -P /home/ubuntu/CockroachDB-ycsb/cockroachdb.properties -threads 1 -p db.url=jdbc:postgresql://172.31.8.131:26257/test -p measurementtype=histogram -p histogram.buckets=25 -p operationcount=300000 -t
Loading workload...
Starting test.
Adding shard node URL: jdbc:postgresql://172.31.8.131:26257/test
Using shards: 1, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[OVERALL], RunTime(ms), 599216.0
[OVERALL], Throughput(ops/sec), 500.6541881391685
[TOTAL_GCS_PS_Scavenge], Count, 19.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 22.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.003671464046353902
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 19.0
[TOTAL_GC_TIME], Time(ms), 22.0
[TOTAL_GC_TIME_%], Time(%), 0.003671464046353902
[READ], Operations, 150310
[READ], AverageLatency(us), 1121.2701417071387
[READ], LatencyVariance(us), 601650.2475011372
[READ], MinLatency(us), 549
[READ], MaxLatency(us), 71793
[READ], 95thPercentileLatency(us), 1000
[READ], 99thPercentileLatency(us), 2000
[READ], Return=OK, 150310
[READ], 0, 77658
[READ], 1, 70238
[READ], 2, 1184
[READ], 3, 362
[READ], 4, 188
[READ], 5, 153
[READ], 6, 177
[READ], 7, 147
[READ], 8, 39
[READ], 9, 46
[READ], 10, 30
[READ], 11, 14
[READ], 12, 12
[READ], 13, 13
[READ], 14, 6
[READ], 15, 7
[READ], 16, 8
[READ], 17, 6
[READ], 18, 2
[READ], 19, 2
[READ], 20, 1
[READ], 21, 3
[READ], 22, 2
[READ], 23, 0
[READ], 24, 0
[READ], >25, 12
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 282.0
[CLEANUP], LatencyVariance(us), 0.0
[CLEANUP], MinLatency(us), 282
[CLEANUP], MaxLatency(us), 282
[CLEANUP], 95thPercentileLatency(us), 0
[CLEANUP], 99thPercentileLatency(us), 0
[CLEANUP], 0, 1
[CLEANUP], 1, 0
[CLEANUP], 2, 0
[CLEANUP], 3, 0
[CLEANUP], 4, 0
[CLEANUP], 5, 0
[CLEANUP], 6, 0
[CLEANUP], 7, 0
[CLEANUP], 8, 0
[CLEANUP], 9, 0
[CLEANUP], 10, 0
[CLEANUP], 11, 0
[CLEANUP], 12, 0
[CLEANUP], 13, 0
[CLEANUP], 14, 0
[CLEANUP], 15, 0
[CLEANUP], 16, 0
[CLEANUP], 17, 0
[CLEANUP], 18, 0
[CLEANUP], 19, 0
[CLEANUP], 20, 0
[CLEANUP], 21, 0
[CLEANUP], 22, 0
[CLEANUP], 23, 0
[CLEANUP], 24, 0
[CLEANUP], >25, 0
[UPDATE], Operations, 149690
[UPDATE], AverageLatency(us), 2873.859416126662
[UPDATE], LatencyVariance(us), 2393349.456954726
[UPDATE], MinLatency(us), 1465
[UPDATE], MaxLatency(us), 70554
[UPDATE], 95thPercentileLatency(us), 4000
[UPDATE], 99thPercentileLatency(us), 8000
[UPDATE], Return=OK, 149690
[UPDATE], 0, 0
[UPDATE], 1, 69944
[UPDATE], 2, 6498
[UPDATE], 3, 64487
[UPDATE], 4, 4584
[UPDATE], 5, 1099
[UPDATE], 6, 627
[UPDATE], 7, 867
[UPDATE], 8, 446
[UPDATE], 9, 378
[UPDATE], 10, 188
[UPDATE], 11, 128
[UPDATE], 12, 102
[UPDATE], 13, 69
[UPDATE], 14, 51
[UPDATE], 15, 27
[UPDATE], 16, 29
[UPDATE], 17, 19
[UPDATE], 18, 23
[UPDATE], 19, 23
[UPDATE], 20, 17
[UPDATE], 21, 13
[UPDATE], 22, 3
[UPDATE], 23, 10
[UPDATE], 24, 6
[UPDATE], >25, 52