experiment_data/ycsb/CockroachDB/run-rper50-hst3-srv9-thr5-this2.log
java -cp /home/ubuntu/CockroachDB-ycsb/postgresql-42.2.2.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/jdbc-binding/conf:/home/ubuntu/CockroachDB-ycsb/ycsb/conf:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/openjpa-jdbc-2.1.1.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/serp-1.13.1.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/commons-collections-3.2.1.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/commons-lang-2.4.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/core-0.12.0.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/commons-pool-1.5.4.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/geronimo-jta_1.1_spec-1.1.1.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/openjpa-lib-2.1.1.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/openjpa-kernel-2.1.1.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/jackson-core-asl-1.9.4.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/HdrHistogram-2.1.4.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/jdbc-binding-0.12.0.jar:/home/ubuntu/CockroachDB-ycsb/ycsb/lib/geronimo-jms_1.1_spec-1.1.1.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.JdbcDBClient -P /home/ubuntu/CockroachDB-ycsb/workloads/workload50 -P /home/ubuntu/CockroachDB-ycsb/cockroachdb.properties -threads 5 -p db.url=jdbc:postgresql://172.31.8.131:26257/test -p measurementtype=histogram -p histogram.buckets=25 -p operationcount=300000 -t
YCSB Client 0.12.0
Command line: -db com.yahoo.ycsb.db.JdbcDBClient -P /home/ubuntu/CockroachDB-ycsb/workloads/workload50 -P /home/ubuntu/CockroachDB-ycsb/cockroachdb.properties -threads 5 -p db.url=jdbc:postgresql://172.31.8.131:26257/test -p measurementtype=histogram -p histogram.buckets=25 -p operationcount=300000 -t
Loading workload...
Starting test.
Adding shard node URL: jdbc:postgresql://172.31.8.131:26257/test
Adding shard node URL: jdbc:postgresql://172.31.8.131:26257/test
Adding shard node URL: jdbc:postgresql://172.31.8.131:26257/test
[...]
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[OVERALL], RunTime(ms), 216296.0
[OVERALL], Throughput(ops/sec), 1386.9882013537006
[TOTAL_GCS_PS_Scavenge], Count, 19.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 26.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.012020564411732071
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 19.0
[TOTAL_GC_TIME], Time(ms), 26.0
[TOTAL_GC_TIME_%], Time(%), 0.012020564411732071
[READ], Operations, 149812
[READ], AverageLatency(us), 1864.8159493231517
[READ], LatencyVariance(us), 1.5138515807786897E7
[READ], MinLatency(us), 559
[READ], MaxLatency(us), 196270
[READ], 95thPercentileLatency(us), 5000
[READ], 99thPercentileLatency(us), 13000
[READ], Return=OK, 149812
[READ], 0, 62493
[READ], 1, 66727
[READ], 2, 8266
[READ], 3, 2881
[READ], 4, 1876
[READ], 5, 1432
[READ], 6, 1127
[READ], 7, 1091
[READ], 8, 892
[READ], 9, 572
[READ], 10, 368
[READ], 11, 249
[READ], 12, 200
[READ], 13, 159
[READ], 14, 131
[READ], 15, 114
[READ], 16, 108
[READ], 17, 106
[READ], 18, 74
[READ], 19, 77
[READ], 20, 69
[READ], 21, 58
[READ], 22, 57
[READ], 23, 47
[READ], 24, 46
[READ], >25, 592
[CLEANUP], Operations, 5
[CLEANUP], AverageLatency(us), 118.4
[CLEANUP], LatencyVariance(us), 11633.039999999997
[CLEANUP], MinLatency(us), 53
[CLEANUP], MaxLatency(us), 332
[CLEANUP], 95thPercentileLatency(us), 0
[CLEANUP], 99thPercentileLatency(us), 0
[CLEANUP], 0, 5
[CLEANUP], 1, 0
[CLEANUP], 2, 0
[CLEANUP], 3, 0
[CLEANUP], 4, 0
[CLEANUP], 5, 0
[CLEANUP], 6, 0
[CLEANUP], 7, 0
[CLEANUP], 8, 0
[CLEANUP], 9, 0
[CLEANUP], 10, 0
[CLEANUP], 11, 0
[CLEANUP], 12, 0
[CLEANUP], 13, 0
[CLEANUP], 14, 0
[CLEANUP], 15, 0
[CLEANUP], 16, 0
[CLEANUP], 17, 0
[CLEANUP], 18, 0
[CLEANUP], 19, 0
[CLEANUP], 20, 0
[CLEANUP], 21, 0
[CLEANUP], 22, 0
[CLEANUP], 23, 0
[CLEANUP], 24, 0
[CLEANUP], >25, 0
[UPDATE], Operations, 150188
[UPDATE], AverageLatency(us), 5300.289537113485
[UPDATE], LatencyVariance(us), 9.774449817634217E7
[UPDATE], MinLatency(us), 1497
[UPDATE], MaxLatency(us), 549321
[UPDATE], 95thPercentileLatency(us), 15000
[UPDATE], Return=OK, 150188
[UPDATE], 0, 0
[UPDATE], 1, 12896
[UPDATE], 2, 53546
[UPDATE], 3, 26216
[UPDATE], 4, 29195
[UPDATE], 5, 5643
[UPDATE], 6, 2779
[UPDATE], 7, 1941
[UPDATE], 8, 2083
[UPDATE], 9, 1951
[UPDATE], 10, 1755
[UPDATE], 11, 1497
[UPDATE], 12, 1093
[UPDATE], 13, 1008
[UPDATE], 14, 849
[UPDATE], 15, 703
[UPDATE], 16, 682
[UPDATE], 17, 598
[UPDATE], 18, 535
[UPDATE], 19, 472
[UPDATE], 20, 371
[UPDATE], 21, 350
[UPDATE], 22, 317
[UPDATE], 23, 287
[UPDATE], 24, 272
[UPDATE], >25, 3149